import { ReviewItem } from "./ReviewItem";

const MOCK_REVIEWS = [
  {
    id: 1,
    name: "محمد خالد",
    date: "13/10/2020",
    rating: 4,
    comment:
      "منتجاتهم مميزه جدا وبجوده عاليه. قمت بشراء الكابلات والفيش من هنا وصراحه اسعار جيده وخامات عاليه جدا. شكرا لكم.",
  },
  {
    id: 2,
    name: "محمد خالد",
    date: "13/10/2020",
    rating: 5,
    comment:
      "منتجاتهم مميزه جدا وبجوده عاليه. قمت بشراء الكابلات والفيش من هنا وصراحه اسعار جيده وخامات عاليه جدا. شكرا لكم.",
  },
  {
    id: 3,
    name: "محمد خالد",
    date: "13/10/2020",
    rating: 4,
    comment:
      "منتجاتهم مميزه جدا وبجوده عاليه. قمت بشراء الكابلات والفيش من هنا وصراحه اسعار جيده وخامات عاليه جدا. شكرا لكم.",
  },
  {
    id: 4,
    name: "محمد خالد",
    date: "13/10/2020",
    rating: 4,
    comment:
      "منتجاتهم مميزه جدا وبجوده عاليه. قمت بشراء الكابلات والفيش من هنا وصراحه اسعار جيده وخامات عاليه جدا. شكرا لكم.",
  },
  {
    id: 5,
    name: "محمد خالد",
    date: "13/10/2020",
    rating: 4,
    comment:
      "منتجاتهم مميزه جدا وبجوده عاليه. قمت بشراء الكابلات والفيش من هنا وصراحه اسعار جيده وخامات عاليه جدا. شكرا لكم.",
  },
  {
    id: 6,
    name: "محمد خالد",
    date: "13/10/2020",
    rating: 4,
    comment:
      "منتجاتهم مميزه جدا وبجوده عاليه. قمت بشراء الكابلات والفيش من هنا وصراحه اسعار جيده وخامات عاليه جدا. شكرا لكم.",
  },
  {
    id: 7,
    name: "محمد خالد",
    date: "13/10/2020",
    rating: 4,
    comment:
      "منتجاتهم مميزه جدا وبجوده عاليه. قمت بشراء الكابلات والفيش من هنا وصراحه اسعار جيده وخامات عاليه جدا. شكرا لكم.",
  },
  {
    id: 8,
    name: "محمد خالد",
    date: "13/10/2020",
    rating: 4,
    comment:
      "منتجاتهم مميزه جدا وبجوده عاليه. قمت بشراء الكابلات والفيش من هنا وصراحه اسعار جيده وخامات عاليه جدا. شكرا لكم.",
  },
  {
    id: 9,
    name: "محمد خالد",
    date: "13/10/2020",
    rating: 4,
    comment:
      "منتجاتهم مميزه جدا وبجوده عاليه. قمت بشراء الكابلات والفيش من هنا وصراحه اسعار جيده وخامات عاليه جدا. شكرا لكم.",
  },
];

export const ReviewList = () => {
  return (
    <div className="scrollbar-thin scrollbar-thumb-gray-200 scrollbar-track-gray-100 h-[545px] overflow-y-auto">
      <div className="me-1">
        {MOCK_REVIEWS.map((review) => (
          <ReviewItem key={review.id} {...review} />
        ))}
      </div>
    </div>
  );
};
